fix(docs): reg
